{
    "Behaviour": [
      {
        "Q": "Tell me about how you worked effectively under pressure?",
        "A": "I had been working on a key project that was scheduled for delivery to the client in 60 days. My supervisor came to me and said that we needed to speed it up and be ready in 45 days, while keeping our other projects on time. I made it into a challenge for my staff, and we effectively added just a few hours to each of our schedules and got the job done in 42 days by sharing the workload.Of course, I had a great group of people to work with, but I think that my effective allocation of tasks was a major component of the success of the project. "
      },
      {
        "Q": "How aware are you of internal politics that may affect your performance?",
        "A": "I'm sensitive to internal politics and respect authority figures. But I also do my best to never become embroiled in office politics. At my level, I consider this to be a wise course of action. I like people and can pretty much work with anyone. So I concentrate on doing my job, listening to directions, surpassing expectations, and leaving the internal political battles to the politicians."
      },
      {
        "Q": "How do you handle a challenge? Give an example.",
        "A": "One time, my supervisor needed to leave town unexpectedly, and we were in the middle of a touchy negotiation with a new sponsor. I was tasked with putting together a PowerPoint presentation just from the notes he had left, and some briefing from his manager. My presentation turned out successfully - we got the sponsorship, and the management team recommended me for an award."
      },
      {
        "Q": "Our clients feel more comfortable with ethnic writers. So, while I would love to recommend you for the position, I'm worried that our clients will feel uneasy about us hiring you.",
        "A": " I sincerely believe that being a great writer requires one major skill beyond being able to string sentences together, and that quality is empathy. I think that, rather than looking at my skin color, your company needs to consider whether or not I can empathize with our target market, and the answer is certainly yes."
      },
      {
        "Q": "What would you do if you really wanted to hire a woman under you, and you knew the perfect candidate, but your boss really wanted to hire a man for the job?",
        "A": " I'd recommend that we perform an on-site \"test,\" by hiring both candidates on a freelance basis for two weeks each."
      },
      {
        "Q": "Under what circumstances have you found it acceptable to break confidence?",
        "A": "When the person doing the confiding has shared the fact that she was doing something unethical — and if I felt that I might be able to stop her behavior by telling someone else about it."
      },
      {
        "Q": "Have you ever made a mistake? How did you handle it? ",
        "A": "Once I misquoted the fees for a particular type of membership to the club where I worked. I explained my mistake to my supervisor, who appreciated my coming to him, and my honesty. He told me to offer to waive the application fee for the new member. The member joined the club despite my mistake, my supervisor was understanding, and although I felt bad that I had made a mistake, I learned to pay close attention to the details so as to give accurate information in the future."
      },
      {
        "Q": "Give an example of how you set goals. ",
        "A": "Within a few weeks of beginning my first job as a sales associate in a department store, I knew that I wanted to be in the fashion industry. I decided that I would work my way up to department manager, and at that point I would have enough money saved to be able to attend design school full-time.  I did just that, and I even landed my first job through an internship I completed the summer before graduation."
      },
      {
        "Q": "Give an example of a goal you reached and tell me how you achieved it. ",
        "A": "When I started working for XYZ Company, I wanted to achieve the Employee of the Month title. It was a motivational challenge, and not all the employees took it that seriously, but I really wanted that parking spot, and my picture on the wall. I went out of my way to be helpful to my colleagues, supervisors, and customers - which I would have done anyway, I liked the job and the people I worked with. The third month I was there, I got the honor. It was good to achieve my goal, and I actually ended up moving into a managerial position there pretty quickly, I think because of my positive attitude and perseverance."
      },
      {
        "Q": "Describe a decision you made that wasn't popular and how you handled implementing it.",
        "A": "Once, I inherited a group of employees when their supervisor relocated to another city. They had been allowed to cover each other’s shifts without management approval. I didn’t like the inconsistencies, where certain people were being given more opportunities than others. I introduced a policy where I had my assistant approve all staffing changes, to make sure that everyone who wanted extra hours and was available at certain times could be utilized. "
      },
      {
        "Q": "Give an example of how you worked on a team.",
        "A": "During my last semester in college, I worked as part of a research team in the History department. The professor leading the project was writing a book on the development of language in Europe in the Middle Ages. We were each assigned different sectors to focus on, and I suggested that we meet independently before our weekly meeting with the professor to discuss our progress, and help each other out if we were having any difficulties. The professor really appreciated the way we worked together, and it helped to streamline his research as well. He was ready to start on his final copy months ahead of schedule because of the work we helped him with."
      },
      {
        "Q": "What do you do if you disagree with someone at work? ",
        "A": "A few years ago, I had a supervisor who wanted me to find ways to outsource most of the work we were doing in my department. I felt that my department was one where having the staff on premises had a huge impact on our effectiveness and ability to relate to our clients. I presented a strong case to her, and she came up with a compromise plan."
      },
      {
        "Q": "Share an example of how you were able to motivate employees or co-workers. ",
        "A": "I was in a situation once where the management of our department was taken over by employees with experience in a totally different industry, in an effort to maximize profits over service. Many of my co-workers were resistant to the sweeping changes that were being made, but I recognized some of the benefits right off the bat, and was able to motivate my colleagues to give the new process a chance to succeed.  "
      },
      {
        "Q": "Can you describe your dream job? ",
        "A": "This is my dream job and that's why I approached you about it in the first place. I am excited about the prospect of helping your promotion agency upgrade and fine tune your loyalty programs.  "
      },
      {
        "Q": " Have you handled a difficult situation? How?",
        "A": "When I worked at ABC Global, it came to my attention that one of my employees had become addicted to painkillers prescribed after she had surgery. Her performance was being negatively impacted, and she needed to get some help. I spoke with her privately, and I helped her to arrange a weekend treatment program that was covered by her insurance. Fortunately, she was able to get her life back on track, and she received a promotion about six months later.  "
      }
    ],
    "Communication": [
      {
        "Q": "How would you describe good/effective communication?",
        "A": "Effective communication is: an interconnected connected system where people and ideas flow quickly, comprehensively, and sustainable. Effective communication is NOT just getting your point across to others quickly \n It is extremely hard to do and takes lots of conscious thought and effort to set-up and maintain. \n·Quickly: The time it takes to think, message, listen, understand and then take action\n·Comprehensively: The people and ideas are sent and received completely·\nSustainably: The cost, whether financial, emotional, or otherwise is very low allowing ideas to flow in the system easily without it breaking down (e.g. shouting and screaming makes things clear, but not sustainable)"
      },
      {
        "Q": " Why and when do we need it?",
        "A": "Effective communication is important all the time in every situation whether professional or personal. Depending on the situation, effective communication can save lives, marriages, countries, or just help avoid every day issues"
      },
      {
        "Q": "What are the greatest challenges to good communication?",
        "A": " People who think communication is about WHAT YOU SAY, versus HOW YOU SAY IT\n·People who focus too much on BEING HEARD, instead of LISTENING TO OTHERS  \n·People who use the WRONG CHANNEL TO SEND A MESSAGE, such as choosing to discuss a difficult situation with someone else through a weak channel such as TEXT, EMAIL, or THROUGH SOMEONE ELSE\n·Not re-evaluating whether effective communication is happening, checking to see if people actually understood what was said"
      },
      {
        "Q": " How important is listening in communication? ",
        "A": "Listening is equally, and some would say even more important, than talking when it comes to good communication."
      },
      {
        "Q": "Has the development of the internet and social media caused a change in the way we communicate (quality, quantity, style etc.)?",
        "A": "Social Media has absolutely changed the way that we communicate, now messages can travel around the world in a matter of seconds and sometimes reaching an audience far larger than any single newspaper could ever hope to reach. Though I tend to think of things in terms of tradeoffs, not just good or bad. Social Media is fast, frequent and brief when it comes to its messaging – snippets, browsing, BUT when it comes to truly understanding someone or something, especially if it’s more complex than a sound bite, or if it’s even totally fake news, Social Media only perpetuates ideas it doesn’t demand that the user really take the time to process or understand these ideas. Just take for example reading someone’s post about “their day” and how different that is than sitting down with that person and actually talking about their day."
      },
      {
        "Q": "If communication is so critical to leadership and business, why isn’t there enough communication in business today?",
        "A": "Communication is often seen as an \"add-on\" to \"hard\" or \"technical\" business skills. Communication is often perceived as someone else’s job. Sometimes leaders spend their time and resources focusing on goals that directly contribute to the bottom line, not knowing that communication does too. And there are a myriad of myths about communication that get in the way, myths such as \"talking is communication\" or \"people won’t interpret situations or give them meaning if leaders don’t talk about them,\" both of which are far from the truth.tweet-button-2015.png"
      },
      {
        "Q": "Why do leaders need to be effective communicators?",
        "A": "Today’s leaders need to be effective leadercommunicators and use strategic communication as a way to achieve the business goals they seek. Leading is communicating; you can’t separate communication from leadership. Without communication, employees lack direction and can’t measure their performance. They lack an ability to see themselves and their work as part of the bigger picture. They can’t add value by contributing as a thinking member of the team.\nAnd what’s most important is that you can’t lead if you can’t express yourself.    \nYour technical skills and abilities can take you only so far. Leadership is much more. It’s about getting things done and moving a business forward through other people.       "
      },
      {
        "Q": "What traits are most important for a skilled leadercommunicator?",
        "A": "Asking questions and listening are critical. Leaders create engagement by focusing on productivity, creating morale and building relationships. Before you can understand a business problem or achieve a goal, you have to understand what the situation is. Asking questions is the best way to come at a problem from varied perspectives. If a leader problem solves from assumptions or only the information at hand, he or she won’t be effective."
      },
      {
        "Q": "Do you consider yourself a leader?",
        "A": "Oh, yes, absolutely. I have all of the leadership qualities. I'm extroverted, but I also happen to be a terrific listener. I consider myself a \"big idea\" person, but I can also be hard-nosed and practical when necessary."
      },
      {
        "Q": "How can leaders inspire their employees when they don’t have good news to share?",
        "A": "The test of great leadership is to ensure understanding in the tough times as well as in the good times. The best leadercommunicators communicate even more in challenging times. They place greater emphasis on two-way dialogue and face-to-face (or at least voice-to-voice) communication, and they’re visible. They listen more than they talk. They ask questions.\nThey’re genuine, honest, and empathetic."
      }
    ],
    "Opinion": [
      {
        "Q": "Will you be out to take my job?",
        "A": "Maybe in about twenty years, but by then, I suspect you'll be running the entire company and will need a good, loyal lieutenant to help you manage this department!"
      },
      {
        "Q": "What if you work here for five years and don't get promoted? Many of our employees don't. Won't you find it frustrating?",
        "A": " I consider myself ambitious, but I'm also practical. As long as I am continuing to learn and grow within my position, I'll be a happy camper. Different companies promote people at different rates, and I'm pretty confident that working for you will keep me motivated and mentally stimulated for several years to come."
      },
      {
        "Q": "If you knew that things at your company were rocky, why didn't you get out of the company sooner ",
        "A": "I was working so hard to keep my job while everyone around me was being cut that I didn't have any time left over to look for another job. With all of the mergers that have been happening in our field, layoffs are a way of life. At least I gave it my best shot!"
      },
      {
        "Q": "What are a couple of the most courageous actions or unpopular stands that you have ever taken?",
        "A": " I used to work for a boss who managed four offices making his time ultra-limited ... he eventually called me one day, and begged me to review their work \"unofficially.\" But there had been a long history in my office of people who would \"act like the boss,\" sans any official title, only to be \"beheaded\" a few months later for overstepping their bounds.I told my supervisor that if he wanted me to be \"acting boss\" in his absence, he needed to let people know officially, and that giving me a new title wouldn't hurt either."
      },
      {
        "Q": "If you were running a company that produces X and the market was tanking for that product, what would you do?",
        "A": " I would search for new markets for the product while I spurred the engineers to change the product to make it more marketable to its original core audience."
      },
      {
        "Q": "We love women at this company, but our clients are Chinese and so we were thinking of hiring a man for this particular job.",
        "A": "Why is that, exactly? It seems to me that I am probably more qualified to handle this position than anyone, man or woman. My father's career as a diplomat took our family around the world seven times, and I even spent my junior year abroad in the Far East. I would need far less training than an American man who grew up here and has never worked outside our borders."
      },
      {
        "Q": "Does a company need B players? Or is it better off only having A players on staff, and why.",
        "A": "I believe that a company needs both A and B players. When you're pitching new business, you want the A players on the front line. But behind the A players, you need the B players who can hammer out the details of the projects and stick with them on a day-to-day basis. Having too many A players on the team leads to ego clashes and a disorganized, anarchical way of doing business."
      },
      {
        "Q": "Are you better at \"managing up\" or \"managing down\"?",
        "A": "If you aren't good at\"managing up,\" you rarely get the opportunity to \"manage down.\" Fortunately, I've always been quite good at self-management. I've never had a deadline that I didn't meet."
      },
      {
        "Q": "What if you worked with someone who managed to 'take credit' for all your great ideas. How would you handle it?",
        "A": "First, I would try to credit her publicly with the ideas that were hers. Sometimes, by being generous with credit, it spurs the other person to \"return the favor.\" If that doesn't solve it, I'd try to work out an arrangement where we each agreed to present the ideas that were our own to our bosses. If that doesn't work, I would openly discuss the situation with her.However, if the person taking credit for my ideas was my boss, I would tread cautiously. To some extent, I believe that my job is to make my superiors shine. If I were being rewarded for my ideas with raises and promotions, I would be happy."
      },
      {
        "Q": "Would you rather get permission from your boss before undertaking a brand-new project, or be given enough rope to \"hang yourself\"?",
        "A": "During my first week on the job, I would ask my boss how she would prefer me to handle projects. If she indicated that she wanted a take-charge person under her, I would take the ropes. If she told me she wanted me to run ideas by her first, I would comply. I think the real challenge is being able to adapt to your work environment, and I'm flexible."
      },
      {
        "Q": "Is it more important to be lucky or skillful?",
        "A": " I think that it's more important to be lucky, although being very skilled can help to create more opportunities. Certainly, [at my former job, my boss'] confidence in me inspired the decision makers at our firm to trust that I could do the job. But clearly, I also happened to be in the right place at the right time.    "
      }
    ],
    "Performance": [
      {
        "Q": "What is your biggest weakness that's really a weakness, and not a secret strength?",
        "A": "I am extremely impatient. I expect my employees to prove themselves on the very first assignment. If they fail, my tendency is to stop delegating to them and start doing everything myself.To compensate for my own weakness, however, I have started to really prep my people on exactly what will be expected of them.  "
      },
      {
        "Q": "You have changed careers before. Why should I let you experiment on my nickel?",
        "A": "As a career-changer, I believe that I'm a better employee because I've gained a lot of diverse skills from moving around. These skills help me solve problems creatively."
      },
      {
        "Q": "From your resume, it looks like you were fired twice. How did that make you feel?",
        "A": "After I recuperated from the shock both times, it made me feel stronger. It's true that I was fired twice, but I managed to bounce back both times and land jobs that gave me more responsibility, paid me more money, and were at better firms.The morale here is very high. I've been exposed to the \"seamy underbelly\" of this business, but I'm still passionate about working in it."
      },
      {
        "Q": "I see from your resume that you worked at CC&L for four years, and that's terrific. But I also noticed that you weren't promoted during that time. Why not?",
        "A": "CC&L is a great company, and thanks in part to my team's contributions, they are doing very well these days. But that wasn't always the case. During the first two years that I worked there, people were being fired left and right, and just hanging onto my job was a feat. Once the company began to turn around, [my boss] was offered a terrific job at a rival organization and it took CC&L six months to replace him, and when they did, the new boss was eager to bring in his own people. Once again, I tenaciously hung on to my job, and, even though I was long overdue for a promotion, I really didn't think that the timing was right for me to broach it. No one from the old staff was there to even vouch for my performance"
      },
      {
        "Q": "Are you telling me that, now that you're forty-something, you would be willing to start at an entry-level position just to get your foot in the door here?",
        "A": "Sometimes you need to take a step backward to move your career forward. Starting in an entry-level role would allow me to learn your business from the ground up. The career that I've been in is so different than yours that I would love the opportunity to start over again in your field. The salary cut will be well worth it."
      },
      {
        "Q": "From your resume, I notice that you interned at a small investment banking boutique. Did you pursue a full-time job offer with them? What happened?",
        "A": "Yes, I did very well at my internship, and I had originally assumed that I would come on staff once I graduated from college. However, BB&L drastically cut back the number of new hires they were planning. As fate would have it, they will not be hiring any of the interns they had last summer. I love working at BB&L, and I brought some references with me today to show you that my job performance there was stellar. Still, in some ways, I consider this new turn of events to be a lucky break for me, believe it or not."
      },
      {
        "Q": "Why did you take so much time off from work, and why do you wish to get a job now?",
        "A": "When I first had the twins, my husband was working 24/7, and I really needed to be there to raise the kids. But during that time, I really missed working.Fortunately, I kept my hand in the business during those years by consulting for several of my ex-clients."
      },
      {
        "Q": "How many hours a week do you usually work, and why?",
        "A": "I work pretty long hours most of the time. With the extra time, I try to find ways to \"add value\" to each assignment, both my own and the firm's. When our clients read our reports, I want them to think that no one else could have possibly written them, except for our company."
      },
      {
        "Q": "This ad agency is a TV shop. But I see from your resume that you have far more experience handling print. You're weak on TV compared to other candidates. Why should I hire you for the job and not someone else who has the credentials that we're really looking for?",
        "A": "One thing I learned from these ad agencies is that print and TV are only mediums. The real thing that we offer clients is our ideas. And a strong, solid award-winning idea will work just as beautifully in TV as in print.So while I may have fewer TV spots on my reel as other candidates, hopefully you'll agree that my ideas are stronger than theirs. Hire me for my ideas, and when you do, I promise you that they will translate seamlessly into TV."
      },
      {
        "Q": "Please give an example of the most difficult political situation that you've dealt with on a job.   ",
        "A": "I was hired by a woman who was on her way out. She asked me to be her \"fall guy\" on a number of assignments. I just learned to drop the assignments off with my boss on the day that they were due, and when the managers would ring me up, I would recommend that they simply follow up with her. This kept me out of hot water with my boss and with her superiors."
      },
      {
        "Q": "Did you ever make a mistake that cost your company money?",
        "A": " I suppose that asking for name-brand vodka at the Christmas party, instead of the generic swill that they normally serve, doesn't count, right? No, really honestly, I'm delighted to report that I never made a mistake that cost my company money."
      },
      {
        "Q": "When do you think you'll peak in your career?",
        "A": "I come from a long line of healthy, hardy, mentally active types, and so I confess that I never even think about \"peaking\" in my career. That having been said, I do think it's important to have some self-knowledge, and to recognize when one is past one's prime."
      },
      {
        "Q": "What do you view as your risks and disadvantages with the position we are interviewing you for?",
        "A": "I think that with the home office located halfway across the globe, there is a very small risk that one might not have the chance to interact with the key decision makers as often as might be ideal. On the other hand, teleconferencing, email, faxing, and having a 24/7 work ethic will go a long way towards bridging the gap."
      }
    ],
    "Brainteasures": [
      {
        "Q": "You are driving a bus. There were 15 passengers already in the bus. You: pick up 20 people from Station A,drop 12 to Station B,pick up 17 from Station C and drop 9 to Station D.Then, what is the age of the driver of bus.",
        "A": "It's your age(for clarification read the first line of question again)"
      },
      {
        "Q": "What will you do if I ran away with your sister?",
        "A": "It's hard to find successful people nowadays. So, I can't find a better person than you in this respect to keep her happy."
      },
      {
        "Q": "You have to enter one of the 2 available rooms. One room is occupied by a pride of lions and another room is full of mirrors with an opening for the rays of sun which can kill you in an instant upon your entering the room.",
        "A": " I will enter the room with mirrors BUT AT NIGHT."
      },
      {
        "Q": " If you have three, you have three. If you have two, you have two but if you have one, you have none. What is it?",
        "A": " Choices."
      },
      {
        "Q": " have to enter one of the three rooms. One room is on fire, another is occupied by a man-eating lion who is hungry for three months and the last one is occupied by a terrorist with a fully loaded AK47.",
        "A": " The 2nd room because the lion is dead because of hunger. (Hungry for 3 months)"
      },
      {
        "Q": "What if your mother is a prostitute?",
        "A": "If my mother is a prostitute, then my father would have been her only customer."
      },
      {
        "Q": " By using only one straight line, can you make the equation correct. 5+5+5=550?",
        "A": " Draw a tilted line on 1st plus (+) operator, + will become 4 \nThe equation then becomes true: 545+5=550."
      },
      {
        "Q": "How many times can you subtract 10 from 100?",
        "A": "Once. Next time you would be subtracting 10 from 90."
      },
      {
        "Q": "How far can you walk into the woods?",
        "A": "Half way. After that you are walking out of the woods."
      },
      {
        "Q": "A little girl kicks a soccer ball. It goes 10 feet and comes back to her. How is this possible? ",
        "A": "Gravity, because she kicked it up"
      },
      {
        "Q": "How can you lift an elephant with one hand? ",
        "A": " It is not a problem, since you will never find an elephant with one hand. "
      },
      {
        "Q": "The Bay of Bengal is in which state?",
        "A": "Liquid"
      },
      {
        "Q": "He ordered a cup of coffee for the candidate. Coffee arrived kept before the candidate, then he asked, what is before you? ",
        "A": "Instantly replied \"Tea\"   \nHe got selected.  \nYou know how and why did he say \"TEA\" when he knows very well that coffee was kept before. (Answer: The question was \"What is before you (U - alphabet) Reply was \"TEA\" ( T - alphabet) "
      },
      {
        "Q": "If two's company, and three's a crowd, then what is four and five?",
        "A": "9"
      },
      {
        "Q": "Twins (Adarsh and Anupam) were born in May but their birthday is in June. How's this possible?",
        "A": "May is the name of town."
      },
      {
        "Q": "This is an unusual paragraph. I'm curious as to just how quickly you can find out what is so unusual about it. It looks so ordinary and plain that you would think nothing was wrong with it. In fact, nothing is wrong with it! It is highly unusual though. Think about it, but you still may not find anything odd. But if you work at it a bit, you might find out!",
        "A": "The letter 'e', which is the most common letter used in the English language, does not appear even once in the paragraph."
      },
      {
        "Q": "How can you drop a raw egg onto a concrete floor without cracking it?",
        "A": " Concrete floors are very hard to crack!"
      },
      {
        "Q": "A cat had three kittens: January, March and May. What was the mother's name.",
        "A": "What. It stated 'WHAT' was the mother's name."
      },
      {
        "Q": "what would you do if your naked sister walked in front of you?",
        "A": "I would kiss her,\nIf she is naked in front of me, that means she must be younger and too small to understand that sort of thing. Then she must be cute, so I would definitely kiss her. How could I miss this chance to kiss such a cute little sister!"
      },
      {
        "Q": " Interviewer said “I shall either ask you ten easy questions or one really difficult question.",
        "A": "The boy thought for a while and said, /“my choice is one really difficult question./”/“Well, good luck to you, you have made your own choice! Now tell me this. /“What comes first, Day or Night?/”The boy was jolted into reality as his admission depends on the correctness of his answer, but he thought for a while and said,/ “It’s the DAY sir!/” \n/“How/” the interviewer asked,/“Sorry sir, you promised me that you will not ask me a SECOND difficult question!"
      },
      {
        "Q":"As we know, some months have 31 days, some months have 30 days; then how many months have 28 days?",
        "A":"All the months have 28 days"
      },
      {
        "Q":" Consider a situation, if you had only one match box and you are asked to go into a room in which there is a kerosene lamp, an oil heater, and a woodburning stove, which would you light first?      ",
        "A":"Matchstick"
      },
      {
        "Q":" What is it that goes up and goes down but does not move?",
        "A":"Temperature"
      },
      {
        "Q":"Is it legal in Argentina for a man to marry his widow's sister?",
        "A":" Not possible as the husband is already dead as stated the wife is a widow.      "
      },
      {
        "Q":"Peacock is one such bird which doesn’t lay eggs, so how do its babies get born?      ",
        "A":"Because Peahen lays eggs not Peacock."
      },
      {
        "Q":"On a dark night Karan and Teena were sitting together. Karan was watching the baseball match in his TV while Teena was reading a novel. Suddenly the power went out and Karan decided to go to bed, but strangely Teena kept on reading. There was no light around. How was that possible?",
        "A":" Teena was blind and she was reading book written in Braille."
      },
      {
        "Q":"There is a crime, that if it is attempted, is punishable, but if it is committed, is not punishable. What is the crime?      ",
        "A":"Suicide."
      },
      {
        "Q":"Can you find a 10 letter word in English language which can be typed using only the 1st rows of the computer keyboard ?      ",
        "A":"Typewriter"
      },
      {
        "Q":" There was a house which had four walls where each wall face the south. In each wall there is a window. Into one of the windows, a bear walks. Can you mention the color of the bear?",
        "A":"Square shaped houses that have walls facing south are found in North Pole, hence, the answer is a white polar bear."
      },
      {
        "Q":" Half of 2+2 will equals to two or three? ",
        "A":"The answer is three, where half of 2 is 1 and plus 2 is 1+2=3."
      },
      {
        "Q":"Is it possible to send a telegram to Washington today?",
        "A":"not possible cause washington is dead."
      },
      {
        "Q":" Divide 30 by 1/2 and then add ten to it, the answer is",
        "A":"70, because we are dividing 30 with 1/2 which will give 60  + 10 =70"
      },
      {
        "Q":"The one that often falls but does not get hurt?",
        "A":"Rain"
      },
      {
        "Q":" Assume that you’re participating in a race, you overtake the second position. What position are you in?",
        "A":"When you overtake the second position, then you would take the second place. Hence, second position is the answer. "
      },
      {
        "Q":"There is a mute person who wanted to buy a tooth brush. He went to the shop, imitated actions by brushing teeth and somehow made the shopkeeper understand that he wanted a toothbrush and purchases it. The question is that when a blind man goes to a shop how would he express himself to buy a pair of glasses?",
        "A":"It is simple because, he just have to open his mouth and say it."
      },
      {
        "Q":" Mary’s father had five daughters who were 1) Nana 2) Nene 3) Nini 4) Nono. Tell me the name of the fifth daughter? ",
        "A":"Mary"
      },
      {
        "Q":"Name three letters that changes a girl into a woman?",
        "A":"age"
      },
      {
        "Q":"You take a sheet of paper; there are now two surfaces on it. Now you are locked in a room where nothing is available. The two surface sheets must be converted into a single surface.",
        "A":"The only way to make a single surface is to make a paper ball out of the same."
      },
      {
        "Q":" How many hairs are on your head?",
        "A":"This is a question to judge your smartness and hence do not offer vague answers. Mention with a smile as many numbers as the stars in the sky."
      },
      {
        "Q":"A clerk is found in a butcher shop where he stands to be 5 feet 10” tall and wears shoes of size 13; tell me what does he weigh?",
        "A":"He weighs meat."
      },
      {
        "Q":"There is one scooter which has 2 tyres and one stepney/spare (meaning 3 tyres). Each tyre can run up to max 5 km. How long will the scooter run till?",
        "A":"7.5 km\nFirst run 2.5 km and change the 1st tyre with stepney. Now kms remains in 1st tyre: 2.5 km, 2nd tyre: 2.5 km, Stepney : 5 km \nAgain run for 2.5 km and this time change 2nd tyre with 1st tyre: Now kms remains 1st tyre: 2.5 km, 2nd tyre :0 km ,stepney : 2.5 km.\nNow run 2.5 km with remaining 1st tyre and stepney .\n Total: 2.5+2.5+2.5=7.5"
      },
      {
        "Q":"An airplane crashed into a field and every single person died except two how come?",
        "A":"Because they were married and not single."
      },
      {
        "Q":"What two words, when combined hold the most letters?",
        "A":"Post office"
      },
      {
        "Q":"Why it is against the law for a man living in south korea, ti be buried in north korea?",
        "A":"Because the man hasn't died yet."
      },
      {
        "Q":"Which word in English language is always spelled incorrectly?",
        "A":"incorrectly."
      },
      {
        "Q":"A cowboy goes in a city in Friday and after two days he came back in Friday, how it is possible?",
        "A":"His horse name is Friday."
      },
      {
        "Q":"There was a red bungalow, Everything is red there, the walls, the furniture, the carpets, then what is the color of the stairs?",
        "A":"There were no stairs, cause it is a bungalow."
      },
      {
        "Q":"What gest wet and wetter the more it dries?",
        "A":"The towel."
      },
      {
        "Q":"What is the exact middle of America?",
        "A":"the letter\"r\""
      },
      {
        "Q":"if the red house is on the right side, if the blue house is in the left side, where is the white house?",
        "A":"Washington DC"
      },
      {
        "Q":"How many times, can you take 5 from 25",
        "A":"once, because after that you have to do it with 20"
      },
      {
        "Q":"How many books can you put in an empty backpack?",
        "A":"One book, after that the bag is not empty anymore."
      },
      {
        "Q":"If there are three apples and you took two of them, how many apples do you have now?",
        "A":"Two because, you took two."
      },
      {
        "Q":"How many legs does an elephant have if you count his trunk as a leg?",
        "A":"FOUR, because counting trunk as a leg, does not make it a leg."
      },
      {
        "Q":"What do you sit on, sleep on, and brush your teeth with",
        "A":"A chair, A bed and toothbrush respectively."
      }
    ]
  }